vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7122.h
// PLL and Oscillator Control

#define          PLLBASE                                    (*(volatile unsigned long      *) 0xFFFF0400)
#define          PLLSTA                                     (*(volatile unsigned long      *) 0xFFFF0400)
#define          POWKEY1                                    (*(volatile unsigned long      *) 0xFFFF0404)
#define          POWCON                                     (*(volatile unsigned long      *) 0xFFFF0408)
#define          POWKEY2                                    (*(volatile unsigned long      *) 0xFFFF040C)
#define          PLLKEY1                                    (*(volatile unsigned long      *) 0xFFFF0410)
#define          PLLCON                                     (*(volatile unsigned long      *) 0xFFFF0414)
#define          PLLKEY2                                    (*(volatile unsigned long      *) 0xFFFF0418)

// Power Supply Monitor

#define          PSMBASE                                    (*(volatile unsigned long      *) 0xFFFF0440)
#define          PSMCON                                     (*(volatile unsigned long      *) 0xFFFF0440)

// Band Gap Reference

#define          BANDGAPBASE                                (*(volatile unsigned long      *) 0xFFFF0480)
#define          REFCON                                     (*(volatile unsigned long      *) 0xFFFF0480)

// ADC interface registers

#define          ADCBASE                                    (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCON                                     (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCP                                      (*(volatile unsigned long      *) 0xFFFF0504)
#define          ADCCN                                      (*(volatile unsigned long      *) 0xFFFF0508)
#define          ADCSTA                                     (*(volatile unsigned long      *) 0xFFFF050C)
#define          ADCDAT                                     (*(volatile unsigned long      *) 0xFFFF0510)
#define          ADCRST                                     (*(volatile unsigned long      *) 0xFFFF0514)
#define          ADCGN                                      (*(volatile unsigned long      *) 0xFFFF0518)
#define          ADCOF                                      (*(volatile unsigned long      *) 0xFFFF051C)
#define          PGAGN                                      (*(volatile unsigned long      *) 0xFFFF0520)

// DAC Interface Peripheral

#define          DACBASE                                    (*(volatile unsigned long      *) 0xFFFF0580)
// DAC0 Control Register
#define          DAC0CON                                    (*(volatile unsigned long      *) 0xFFFF0580)
// DAC0 Data Register
#define          DAC0DAT                                    (*(volatile unsigned long      *) 0xFFFF0584)
// DAC1 Control Register
#define          DAC1CON                                    (*(volatile unsigned long      *) 0xFFFF0588)
// DAC1 Data Register
#define          DAC1DAT                                    (*(volatile unsigned long      *) 0xFFFF058C)
// DAC2 Control Register
#define          DAC2CON                                    (*(volatile unsigned long      *) 0xFFFF0590)
// DAC2 Data Register
#define          DAC2DAT                                    (*(volatile unsigned long      *) 0xFFFF0594)
// DAC3 Control Register
#define          DAC3CON                                    (*(volatile unsigned long      *) 0xFFFF0598)
// DAC3 Data Register
#define          DAC3DAT                                    (*(volatile unsigned long      *) 0xFFFF059C)
// DAC4 Control Register
#define          DAC4CON                                    (*(volatile unsigned long      *) 0xFFFF05A0)
// DAC4 Data Register
#define          DAC4DAT                                    (*(volatile unsigned long      *) 0xFFFF05A4)
// DAC5 Control Register
#define          DAC5CON                                    (*(volatile unsigned long      *) 0xFFFF05A8)
// DAC5 Data Register
#define          DAC5DAT                                    (*(volatile unsigned long      *) 0xFFFF05AC)
// DAC6 Control Register
#define          DAC6CON                                    (*(volatile unsigned long      *) 0xFFFF05B0)
// DAC6 Data Register
#define          DAC6DAT                                    (*(volatile unsigned long      *) 0xFFFF05B4)
// DAC7 Control Register
#define          DAC7CON                                    (*(volatile unsigned long      *) 0xFFFF05B8)
// DAC7 Data Register
#define          DAC7DAT                                    (*(volatile unsigned long      *) 0xFFFF05BC)
// DAC8 Control Register
#define          DAC8CON                                    (*(volatile unsigned long      *) 0xFFFF05C0)
// DAC8 Data Register
#define          DAC8DAT                                    (*(volatile unsigned long      *) 0xFFFF05C4)
// DAC9 Control Register
#define          DAC9CON                                    (*(volatile unsigned long      *) 0xFFFF05C8)
// DAC9 Data Register
#define          DAC9DAT                                    (*(volatile unsigned long      *) 0xFFFF05CC)
// DAC10 Control Register
#define          DAC10CON                                   (*(volatile unsigned long      *) 0xFFFF05D0)
// DAC10 Data Register
#define          DAC10DAT                                   (*(volatile unsigned long      *) 0xFFFF05D4)
// DAC11 Control Register
#define          DAC11CON                                   (*(volatile unsigned long      *) 0xFFFF05D8)
// DAC11 Data Register
#define          DAC11DAT                                   (*(volatile unsigned long      *) 0xFFFF05DC)

// 450 Compatible UART core registers

#define          UARTBASE                                   (*(volatile unsigned long      *) 0xFFFF0800)
// Transmit Holding register
#define          COMTX                                      (*(volatile unsigned long      *) 0xFFFF0800)
// Receive Buffer register
#define          COMRX                                      (*(volatile unsigned long      *) 0xFFFF0800)
// Divisor Latch Low byte register
#define          COMDIV0                                    (*(volatile unsigned long      *) 0xFFFF0800)
// Interrupt Enable register
#define          COMIEN0                                    (*(volatile unsigned long      *) 0xFFFF0804)
// Divisor Latch High byte register
#define          COMDIV1                                    (*(volatile unsigned long      *) 0xFFFF0804)
// Interrupt Identification register
#define          COMIID0                                    (*(volatile unsigned long      *) 0xFFFF0808)
// Line Control register
#define          COMCON0                                    (*(volatile unsigned long      *) 0xFFFF080C)
// Module Control register
#define          COMCON1                                    (*(volatile unsigned long      *) 0xFFFF0810)
// Line Status register
#define          COMSTA0                                    (*(volatile unsigned long      *) 0xFFFF0814)
// Modem Status register
#define          COMSTA1                                    (*(volatile unsigned long      *) 0xFFFF0818)
// Modem Interrupts
#define          COMIID1                                    (*(volatile unsigned long      *) 0xFFFF0824)
// Fraction divider register.
#define          COMDIV2                                    (*(volatile unsigned long      *) 0xFFFF082C)

