vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7122.h
// Flash Control Interface 1

#define          FLASH1BASE                                 (*(volatile unsigned long      *) 0xFFFF0E80)
// Command Status Register
#define          FEE1STA                                    (*(volatile unsigned long      *) 0xFFFF0E80)
// Mode Register
#define          FEE1MOD                                    (*(volatile unsigned long      *) 0xFFFF0E84)
// Command Code Interpreter
#define          FEE1CON                                    (*(volatile unsigned long      *) 0xFFFF0E88)
// "Data Register, data to be written or verified (32 bits)"
#define          FEE1DAT                                    (*(volatile unsigned long      *) 0xFFFF0E8C)
// "Command Location Index, memory array sector address"
#define          FEE1ADR                                    (*(volatile unsigned long      *) 0xFFFF0E90)
// Code signature onto 24 bits LFSR
#define          FEE1SIG                                    (*(volatile unsigned long      *) 0xFFFF0E98)
// 32bits used for user write protection
#define          FEE1PRO                                    (*(volatile unsigned long      *) 0xFFFF0E9C)
// "Protection download, writable with key only"
#define          FEE1HID                                    (*(volatile unsigned long      *) 0xFFFF0EA0)

// Pulse Width Modulator

#define          PWMBASE                                    (*(volatile unsigned long      *) 0xFFFF0F80)
// PWM Control
#define          PWMCON1                                    (*(volatile unsigned long      *) 0xFFFF0F80)
// Compare register 1 for PWM o/ps 1 and 2
#define          PWM1COM1                                   (*(volatile unsigned long      *) 0xFFFF0F84)
// Compare register 2 for PWM o/ps 1 and 2
#define          PWM1COM2                                   (*(volatile unsigned long      *) 0xFFFF0F88)
// Compare register 3 for PWM o/ps 1 and 2
#define          PWM1COM3                                   (*(volatile unsigned long      *) 0xFFFF0F8C)
// Frequency Control for PWM o/ps 1 and 2
#define          PWM1LEN                                    (*(volatile unsigned long      *) 0xFFFF0F90)
// Compare register 1 for PWM o/ps 3 and 4
#define          PWM2COM1                                   (*(volatile unsigned long      *) 0xFFFF0F94)
// Compare register 2 for PWM o/ps 3 and 4
#define          PWM2COM2                                   (*(volatile unsigned long      *) 0xFFFF0F98)
// Compare register 3 for PWM o/ps 3 and 4
#define          PWM2COM3                                   (*(volatile unsigned long      *) 0xFFFF0F9C)
// Frequency Control for PWM o/ps 3 and 4
#define          PWM2LEN                                    (*(volatile unsigned long      *) 0xFFFF0FA0)
// Compare register 1 for PWM o/ps 5 and 6
#define          PWM3COM1                                   (*(volatile unsigned long      *) 0xFFFF0FA4)
// Compare register 2 for PWM o/ps 5 and 6
#define          PWM3COM2                                   (*(volatile unsigned long      *) 0xFFFF0FA8)
// Compare register 3 for PWM o/ps 5 and 6
#define          PWM3COM3                                   (*(volatile unsigned long      *) 0xFFFF0FAC)
// Frequency Control for PWM o/ps 5 and 6
#define          PWM3LEN                                    (*(volatile unsigned long      *) 0xFFFF0FB0)
// PWM Convert Start Control
#define          PWMCON2                                    (*(volatile unsigned long      *) 0xFFFF0FB4)
// PWM Interrupt Clear
#define          PWMCLRI                                    (*(volatile unsigned long      *) 0xFFFF0FB8)
/*    Function Pointers for Interrupts  */
typedef void (* tyVctHndlr) (void);

extern tyVctHndlr    IRQ;
extern tyVctHndlr    SWI;
extern tyVctHndlr    FIQ;
extern tyVctHndlr    UNDEF;
extern tyVctHndlr    PABORT;
extern tyVctHndlr    DABORT;
